Revit 2027 API
DuctPressureDropData.CategoryId Property
 The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId CategoryId { get; }
Public ReadOnly Property CategoryId As ElementId
	Get
public:
property ElementId^ CategoryId {
	ElementId^ get ();
}
member CategoryId : ElementId with get
Property Value
ElementId
See Also
Reference
DuctPressureDropData Class
Autodesk.Revit.DB.Mechanical Namespace